; domain
(define (domain restaurantB)
	(:requirements :strips :adl :typing :fluents)
	
	(:types 
        robot - object
        customer - object
        plate - object
        location
	)

	(:predicates
		(at ?obj - object ?loc - location)
		(adjacent ?loc1 - location ?loc2 - location)
		(hasFood ?p - plate)
		(hasPlate ?r - robot)
		(holding ?r - robot ?p - plate)
		(served ?c - customer)
		(buffet ?loc - location)
	)

	(:action pick-up
		:parameters (?r - robot ?p - plate ?loc - location)
		:precondition (and
			(at ?r ?loc)
			(at ?p ?loc)
			(not (hasPlate ?r))
		)
		:effect (and
			(holding ?r ?p)
			(hasPlate ?r)
			(not (at ?p ?loc))
		)
	)

	(:action present
		:parameters (?r - robot ?p - plate ?loc - location ?c - customer)
		:precondition (and
			(at ?c ?loc)
			(at ?r ?loc)
			(holding ?r ?p)
			(hasFood ?p)
			(not (served ?c))
		)
		:effect (and
			(served ?c)
			(not (holding ?r ?p))
			(not (hasPlate ?r))
			(at ?p ?loc)
		)
	)

	(:action fill
		:parameters (?r - robot ?p - plate ?loc - location)
		:precondition (and
			(at ?r ?loc)
			(buffet ?loc)
			(holding ?r ?p)
			(not (hasFood ?p))
		)
		:effect (and
			(hasFood ?p)
		)
	)

	(:action move
		:parameters (?r - robot ?loc1 - location ?loc2 - location)
		:precondition (and
			(at ?r ?loc1)
			(adjacent ?loc1 ?loc2)
		)
		:effect (and
			(at ?r ?loc2)
			(not (at ?r ?loc1))
		)
	)
)

; problem
(define (problem problem3)
  (:domain restaurantB)
  
  ;; Define objects

  (:objects
    robot - robot
    plate1 - plate
    plate2 - plate
    plate3 - plate
    customer1 - customer
    customer2 - customer
    customer3 - customer
    BTA AMA AUA PLA PMA PUA ALA - location
  )
  
  (:init

    ;; Robot initialization

    (at robot ALA)

    ;; Plate initialization

    (at plate1 PLA)
    (at plate2 ALA)
    (at plate3 AMA)

    ;; Customer initialization

    (at customer1 PMA)
    (at customer2 ALA)
    (at customer3 PLA)

    ;; Define adjacent rooms

    (adjacent BTA AUA) (adjacent AUA BTA)
    (adjacent AUA AMA) (adjacent AMA AUA)
    (adjacent AUA PUA) (adjacent PUA AUA)
    (adjacent PUA PMA) (adjacent PMA PUA)
    (adjacent PMA PLA) (adjacent PLA PMA)
    (adjacent AMA ALA) (adjacent ALA AMA)
    (adjacent PLA ALA) (adjacent ALA PLA)

    ;; Specify in which room the buffet is located
    (buffet BTA)
  )
  
  ;; Define the goal state

  (:goal
    (and 
        (at robot PUA)
        (served customer1) (served customer2) (served customer3)
    )
  )
)

; plan
1. (pick-up robot plate2 ala)
   deleted: (at plate2 ala)
   added: (holding robot plate2) (hasplate robot)
   goals met: 0 of 4
2. (move robot ala ama)
   deleted: (at robot ala)
   added: (at robot ama)
   goals met: 0 of 4
3. (move robot ama aua)
   deleted: (at robot ama)
   added: (at robot aua)
   goals met: 0 of 4
4. (move robot aua bta)
   deleted: (at robot aua)
   added: (at robot bta)
   goals met: 0 of 4
5. (fill robot plate2 bta)
   added: (hasfood plate2)
   goals met: 0 of 4
6. (move robot bta aua)
   deleted: (at robot bta)
   added: (at robot aua)
   goals met: 0 of 4
7. (move robot aua pua)
   deleted: (at robot aua)
   added: (at robot pua)
   goals met: 1 of 4
8. (move robot pua pma)
   deleted: (at robot pua)
   added: (at robot pma)
   goals met: 0 of 4
9. (present robot plate2 pma customer1)
   deleted: (holding robot plate2) (hasplate robot)
   added: (served customer1) (at plate2 pma)
   goals met: 1 of 4
10. (pick-up robot plate2 pma)
   deleted: (at plate2 pma)
   added: (holding robot plate2) (hasplate robot)
   goals met: 1 of 4
11. (move robot pma pla)
   deleted: (at robot pma)
   added: (at robot pla)
   goals met: 1 of 4
12. (present robot plate2 pla customer3)
   deleted: (holding robot plate2) (hasplate robot)
   added: (served customer3) (at plate2 pla)
   goals met: 2 of 4
13. (pick-up robot plate2 pla)
   deleted: (at plate2 pla)
   added: (holding robot plate2) (hasplate robot)
   goals met: 2 of 4
14. (move robot pla ala)
   deleted: (at robot pla)
   added: (at robot ala)
   goals met: 2 of 4
15. (present robot plate2 ala customer2)
   deleted: (holding robot plate2) (hasplate robot)
   added: (served customer2) (at plate2 ala)
   goals met: 3 of 4
16. (move robot ala ama)
   deleted: (at robot ala)
   added: (at robot ama)
   goals met: 3 of 4
17. (move robot ama aua)
   deleted: (at robot ama)
   added: (at robot aua)
   goals met: 3 of 4
18. (move robot aua pua)
   deleted: (at robot aua)
   added: (at robot pua)
   goals met: 4 of 4
